Repository: nkanf-dev/Lyrisland
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

# help.interactions.click
source: Click the island to cycle through states: Compact → Expanded → Full → Compact.
ja: アイランドをクリックして状態を切り替え：コンパクト → 展開 → フル → コンパクト。
ko: 아일랜드를 클릭하여 상태 전환: 컴팩트 → 확장 → 전체 → 컴팩트.
zh_hans: 点击灵动岛切换状态：紧凑 → 展开 → 完整 → 紧凑。
zh_hant: 點按靈動島切換狀態：緊湊 → 展開 → 完整 → 緊湊。

# help.interactions.drag
source: Once detached, drag the island to reposition it anywhere on screen.
ja: 切り離した後、アイランドをドラッグして画面上の任意の位置に移動できます。
ko: 분리 후 아일랜드를 드래그하여 화면 어디든 위치를 변경할 수 있습니다.
zh_hans: 脱离后可拖拽灵动岛至屏幕任意位置。
zh_hant: 脫離後可拖曳靈動島至螢幕任意位置。

# help.interactions.longpress
source: Long-press (hold for 0.5s) the island to detach it from the menu bar and unlock dragging.
ja: アイランドを長押し（0.5秒）するとメニューバーから切り離し、ドラッグが可能になります。
ko: 아일랜드를 길게 누르면(0.5초) 메뉴 막대에서 분리되어 드래그할 수 있습니다.
zh_hans: 长按灵动岛（按住 0.5 秒）可将其从菜单栏脱离，解锁拖拽功能。
zh_hant: 長按靈動島（按住 0.5 秒）可將其從選單列脫離，解鎖拖曳功能。

# help.interactions.snap
source: Drag the island back near the top of the screen to snap it back to the menu bar.
ja: アイランドを画面上部付近にドラッグすると、メニューバーに再び固定されます。
ko: 아일랜드를 화면 상단 근처로 드래그하면 메뉴 막대에 다시 부착됩니다.
zh_hans: 将灵动岛拖拽至屏幕顶部附近即可自动吸附回菜单栏。
zh_hant: 將靈動島拖曳至螢幕頂部附近即可自動吸附回選單列。

# help.providers.chain
source: Lyrics are fetched from multiple sources in order: LRCLIB → Musixmatch → Soda Music → Netease. The first source that returns synced lyrics wins.
ja: 歌詞は複数のソースから順番に取得されます：LRCLIB → Musixmatch → Soda Music → Netease。最初に同期歌詞を返したソースが使用されます。
ko: 가사는 여러 소스에서 순서대로 가져옵니다: LRCLIB → Musixmatch → Soda Music → Netease. 싱크 가사를 먼저 반환하는 소스가 사용됩니다.
zh_hans: 歌词按优先级依次从多个来源获取：LRCLIB → Musixmatch → 汽水音乐 → 网易云。首个返回同步歌词的来源将被采用。
zh_hant: 歌詞依優先順序從多個來源取得：LRCLIB → Musixmatch → 汽水音樂 → 網易雲。首個回傳同步歌詞的來源將被採用。

# help.section.interactions
source: Island Interactions
ja: アイランドの操作
ko: 아일랜드 상호작용
zh_hans: 灵动岛交互
zh_hant: 靈動島互動

# help.section.providers
source: Lyrics Providers
ja: 歌詞プロバイダー
ko: 가사 제공자
zh_hans: 歌词来源
zh_hant: 歌詞來源

# help.section.settings
source: Settings
ja: 設定
ko: 설정
zh_hans: 设置说明
zh_hant: 設定說明

# help.section.shortcuts
source: Keyboard Shortcuts
ja: キーボードショートカット
ko: 키보드 단축키
zh_hans: 键盘快捷键
zh_hant: 鍵盤快速鍵

# help.settings.alignment
source: Lyrics Alignment — choose left, center, or right alignment for lyrics text.
ja: 歌詞の配置 — 歌詞テキストの左揃え、中央揃え、右揃えを選択します。
ko: 가사 정렬 — 가사 텍스트의 왼쪽, 가운데, 오른쪽 정렬을 선택합니다.
zh_hans: 歌词对齐 — 选择歌词文本的对齐方式：左对齐、居中或右对齐。
zh_hant: 歌詞對齊 — 選擇歌詞文字的對齊方式：靠左、置中或靠右。

# help.settings.artwork
source: Show Artwork — display album cover art alongside lyrics in the island.
ja: アートワーク表示 — アイランドに歌詞と一緒にアルバムカバーを表示します。
ko: 아트워크 표시 — 아일랜드에 가사와 함께 앨범 커버를 표시합니다.
zh_hans: 显示专辑封面 — 在灵动岛中展示当前播放歌曲的封面图片。
zh_hant: 顯示專輯封面 — 在靈動島中展示當前播放歌曲的封面圖片。

# help.settings.dualline
source: Dual-Line Mode — show the current lyric line and the next line together.
ja: 2行モード — 現在の歌詞行と次の行を同時に表示します。
ko: 2줄 모드 — 현재 가사와 다음 줄을 함께 표시합니다.
zh_hans: 双行模式 — 同时显示当前歌词和下一行歌词。
zh_hant: 雙行模式 — 同時顯示當前歌詞和下一行歌詞。

# help.settings.offset
source: Lyrics Offset — adjust timing offset when lyrics are out of sync. Use ±0.5s buttons or ⌘[ / ⌘] shortcuts.
ja: 歌詞オフセット — 歌詞がずれている場合にタイミングを調整します。±0.5秒ボタンまたは ⌘[ / ⌘] ショートカットを使用。
ko: 가사 오프셋 — 가사가 맞지 않을 때 타이밍을 조정합니다. ±0.5초 버튼 또는 ⌘[ / ⌘] 단축키를 사용하세요.
zh_hans: 歌词偏移 — 当歌词不同步时调整时间偏移。可使用 ±0.5 秒按钮或 ⌘[ / ⌘] 快捷键。
zh_hant: 歌詞偏移 — 當歌詞不同步時調整時間偏移。可使用 ±0.5 秒按鈕或 ⌘[ / ⌘] 快捷鍵。

# help.settings.position
source: Position Mode — switch between Attached (pinned to menu bar) and Detached (free-floating) modes.
ja: 位置モード — 固定（メニューバーに固定）とフリー（自由移動）モードを切り替えます。
ko: 위치 모드 — 부착(메뉴 막대에 고정)과 분리(자유 이동) 모드를 전환합니다.
zh_hans: 位置模式 — 在吸附（固定于菜单栏）和自由（浮动拖拽）模式之间切换。
zh_hant: 位置模式 — 在吸附（固定於選單列）和自由（浮動拖曳）模式之間切換。

# help.shortcuts.help
source: ⌘? — Open this Help window.
ja: ⌘? — このヘルプウィンドウを開く。
ko: ⌘? — 이 도움말 창 열기.
zh_hans: ⌘? — 打开此帮助窗口。
zh_hant: ⌘? — 開啟此輔助說明視窗。

# help.shortcuts.quit
source: ⌘Q — Quit Lyrisland.
ja: ⌘Q — Lyrisland を終了。
ko: ⌘Q — Lyrisland 종료.
zh_hans: ⌘Q — 退出 Lyrisland。
zh_hant: ⌘Q — 結束 Lyrisland。

# help.shortcuts.settings
source: ⌘, — Open the Settings window.
ja: ⌘, — 設定ウィンドウを開く。
ko: ⌘, — 설정 창 열기.
zh_hans: ⌘, — 打开设置窗口。
zh_hant: ⌘, — 開啟設定視窗。

# help.shortcuts.toggle
source: ⌘L — Show or hide the lyrics island.
ja: ⌘L — 歌詞アイランドの表示/非表示を切り替え。
ko: ⌘L — 가사 아일랜드 표시/숨기기.
zh_hans: ⌘L — 显示或隐藏歌词灵动岛。
zh_hant: ⌘L — 顯示或隱藏歌詞靈動島。

# help.title
source: Lyrisland Help
ja: Lyrisland ヘルプ
ko: Lyrisland 도움말
zh_hans: Lyrisland 帮助
zh_hant: Lyrisland 輔助說明

# lyrics.loading
source: Loading lyrics…
ja: 歌詞を読み込み中…
ko: 가사 로딩 중…
zh_hans: 正在加载歌词…
zh_hant: 正在載入歌詞…

# lyrics.no_lyrics
source: No lyrics available
ja: 歌詞がありません
ko: 가사 없음
zh_hans: 暂无歌词
zh_hant: 暫無歌詞

# lyrics.no_synced
source: No synced lyrics found
ja: 同期歌詞が見つかりません
ko: 싱크 가사를 찾을 수 없습니다
zh_hans: 未找到同步歌词
zh_hant: 未找到同步歌詞

# lyrics.not_available
source: No lyrics available for this track
ja: このトラックの歌詞はありません
ko: 이 트랙의 가사를 사용할 수 없습니다
zh_hans: 暂无歌词
zh_hant: 暫無歌詞

# lyrics.paused
source: Paused
ja: 一時停止中
ko: 일시정지됨
zh_hans: 已暂停
zh_hant: 已暫停

# lyrics.play_to_start
source: Play a song to start
ja: 曲を再生して開始
ko: 노래를 재생하여 시작하세요
zh_hans: 播放歌曲即可开始
zh_hant: 播放歌曲即可開始

# menu.choose_lyrics
source: Choose Lyrics…
ja: 歌詞を選択…
ko: 가사 선택…
zh_hans: 选择歌词…
zh_hant: 選擇歌詞…

# menu.dual_line
source: Dual-Line Mode
ja: 2行表示モード
ko: 2줄 모드
zh_hans: 双行歌词模式
zh_hant: 雙行歌詞模式

# menu.help
source: Help
ja: ヘルプ
ko: 도움말
zh_hans: 帮助
zh_hant: 輔助說明

# menu.no_track
source: No track playing
ja: 再生中のトラックなし
ko: 재생 중인 트랙 없음
zh_hans: 未在播放
zh_hant: 未在播放

# menu.offset
source: Lyrics Offset
ja: 歌詞オフセット
ko: 가사 오프셋
zh_hans: 歌词偏移
zh_hant: 歌詞偏移

# menu.offset.earlier
source: Earlier (-0.5s)
ja: 早める（-0.5秒）
ko: 앞으로 (-0.5초)
zh_hans: 提前（-0.5秒）
zh_hant: 提前（-0.5秒）

# menu.offset.later
source: Later (+0.5s)
ja: 遅らせる（+0.5秒）
ko: 뒤로 (+0.5초)
zh_hans: 延后（+0.5秒）
zh_hant: 延後（+0.5秒）

# menu.offset.reset
source: Reset Offset
ja: オフセットをリセット
ko: 오프셋 초기화
zh_hans: 重置偏移
zh_hant: 重設偏移

# menu.offset.value
source: Offset: %1$.1fs
ja: オフセット：%1$.1f秒
ko: 오프셋: %1$.1f초
zh_hans: 偏移：%1$.1f秒
zh_hant: 偏移：%1$.1f秒

# menu.position.attach
source: Attach to Menu Bar
ja: メニューバーに固定
ko: 메뉴 막대에 부착
zh_hans: 吸附到菜单栏
zh_hant: 吸附到選單列

# menu.position.detach
source: Detach from Menu Bar
ja: メニューバーから切り離す
ko: 메뉴 막대에서 분리
zh_hans: 脱离菜单栏
zh_hant: 脫離選單列

# menu.quit
source: Quit
ja: 終了
ko: 종료
zh_hans: 退出
zh_hant: 結束

# menu.settings
source: Settings…
ja: 設定…
ko: 설정…
zh_hans: 设置…
zh_hant: 設定⋯

# menu.show_artwork
source: Album Artwork
ja: アルバムアートワーク
ko: 앨범 아트워크
zh_hans: 显示专辑封面
zh_hant: 顯示專輯封面

# menu.show_hide
source: Show/Hide Lyrics
ja: 歌詞を表示/非表示
ko: 가사 표시/숨기기
zh_hans: 显示/隐藏歌词
zh_hant: 顯示/隱藏歌詞

# menu.switch_source
source: Lyrics Source
ja: 歌詞ソース
ko: 가사 소스
zh_hans: 歌词来源
zh_hant: 歌詞來源

# menu.welcome
source: Welcome to Lyrisland
ja: Lyrisland へようこそ
ko: Lyrisland에 오신 것을 환영합니다
zh_hans: 欢迎使用 Lyrisland
zh_hant: 歡迎使用 Lyrisland

# onboarding.back
source: Back
ja: 戻る
ko: 뒤로
zh_hans: 返回
zh_hant: 返回

# onboarding.continue
source: Continue
ja: 続ける
ko: 계속
zh_hans: 继续
zh_hant: 繼續

# onboarding.get_started
source: Get Started
ja: はじめる
ko: 시작하기
zh_hans: 开始使用
zh_hant: 開始使用

# onboarding.how_it_works
source: How it works
ja: 仕組み
ko: 작동 방식
zh_hans: 工作原理
zh_hant: 運作方式

# onboarding.open_spotify
source: Open Spotify
ja: Spotify を開く
ko: Spotify 열기
zh_hans: 打开 Spotify
zh_hant: 開啟 Spotify

# onboarding.permission
source: Automation Permission
ja: オートメーション権限
ko: 자동화 권한
zh_hans: 自动化权限
zh_hant: 自動化權限

# onboarding.permission.desc
source: macOS requires your approval to let this app communicate with Spotify.
ja: このアプリが Spotify と通信するには、macOS の許可が必要です。
ko: 이 앱이 Spotify와 통신하려면 macOS 승인이 필요합니다.
zh_hans: macOS 需要你的授权，以便本应用与 Spotify 通信。
zh_hant: macOS 需要您的授權，以便本應用程式與 Spotify 通訊。

# onboarding.permission.granted
source: Permission granted
ja: 権限が許可されました
ko: 권한이 부여되었습니다
zh_hans: 权限已授予
zh_hant: 權限已授予

# onboarding.permission.guide
source: When prompted, click "OK" to grant Automation access. You can also enable it in System Settings → Privacy & Security → Automation.
ja: プロンプトが表示されたら「OK」をクリックしてオートメーションアクセスを許可してください。システム設定 → プライバシーとセキュリティ → オートメーションからも有効にできます。
ko: 메시지가 표시되면 "확인"을 클릭하여 자동화 접근 권한을 부여하세요. 시스템 설정 → 개인정보 보호 및 보안 → 자동화에서도 활성화할 수 있습니다.
zh_hans: 出现提示时，点击「好」授予自动化权限。你也可以在系统设置 → 隐私与安全性 → 自动化中手动开启。
zh_hant: 出現提示時，點按「好」授予自動化權限。您也可以在系統設定 → 隱私權與安全性 → 自動化中手動開啟。

# onboarding.permission.pending
source: Permission will be requested when Spotify is accessed
ja: Spotify へのアクセス時に権限がリクエストされます
ko: Spotify에 접근할 때 권한이 요청됩니다
zh_hans: 访问 Spotify 时将请求权限
zh_hant: 存取 Spotify 時將請求權限

# onboarding.ready
source: You're all set!
ja: 準備完了！
ko: 모든 준비가 완료되었습니다!
zh_hans: 一切就绪！
zh_hant: 一切就緒！

# onboarding.refresh
source: Refresh
ja: 更新
ko: 새로고침
zh_hans: 刷新
zh_hant: 重新整理

# onboarding.spotify_check
source: Spotify Desktop App
ja: Spotify デスクトップアプリ
ko: Spotify 데스크톱 앱
zh_hans: Spotify 桌面客户端
zh_hant: Spotify 桌面客戶端

# onboarding.spotify.install_hint
source: Please install the Spotify desktop app first.
ja: 先に Spotify デスクトップアプリをインストールしてください。
ko: 먼저 Spotify 데스크톱 앱을 설치해 주세요.
zh_hans: 请先安装 Spotify 桌面客户端。
zh_hant: 請先安裝 Spotify 桌面客戶端。

# onboarding.spotify.launch_hint
source: Launch Spotify and play a song to get started.
ja: Spotify を起動して曲を再生すると開始できます。
ko: Spotify를 실행하고 노래를 재생하면 시작됩니다.
zh_hans: 启动 Spotify 并播放一首歌曲即可开始。
zh_hant: 啟動 Spotify 並播放一首歌曲即可開始。

# onboarding.spotify.not_found
source: Spotify not found
ja: Spotify が見つかりません
ko: Spotify를 찾을 수 없습니다
zh_hans: 未找到 Spotify
zh_hant: 找不到 Spotify

# onboarding.spotify.not_running
source: Spotify is not running
ja: Spotify が起動していません
ko: Spotify가 실행 중이 아닙니다
zh_hans: Spotify 未在运行
zh_hant: Spotify 未在執行

# onboarding.spotify.ready_hint
source: Ready to display lyrics!
ja: 歌詞を表示する準備ができました！
ko: 가사를 표시할 준비가 되었습니다!
zh_hans: 已准备好显示歌词！
zh_hant: 已準備好顯示歌詞！

# onboarding.spotify.running
source: Spotify is running
ja: Spotify 起動中
ko: Spotify 실행 중
zh_hans: Spotify 运行中
zh_hant: Spotify 執行中

# onboarding.step.automation
source: Reads playback info from the Spotify desktop app via macOS Automation — no account login needed.
ja: macOS オートメーションを通じて Spotify デスクトップアプリから再生情報を取得します。アカウントログインは不要です。
ko: macOS 자동화를 통해 Spotify 데스크톱 앱에서 재생 정보를 읽습니다. 계정 로그인이 필요 없습니다.
zh_hans: 通过 macOS 自动化功能读取 Spotify 桌面客户端的播放信息，无需登录账号。
zh_hant: 透過 macOS 自動化功能讀取 Spotify 桌面客戶端的播放資訊，無需登入帳號。

# onboarding.step.display
source: Displays lyrics in a floating Dynamic Island at the top of your screen.
ja: 画面上部のフローティングダイナミックアイランドに歌詞を表示します。
ko: 화면 상단의 플로팅 다이나믹 아일랜드에 가사를 표시합니다.
zh_hans: 在屏幕顶部以灵动岛的形式展示歌词。
zh_hant: 在螢幕頂部以靈動島的形式顯示歌詞。

# onboarding.step.lyrics
source: Fetches synced lyrics from open sources (LRCLIB, Musixmatch, Soda Music).
ja: オープンソース（LRCLIB、Musixmatch、Soda Music）から同期歌詞を取得します。
ko: 오픈 소스(LRCLIB, Musixmatch, Soda Music)에서 싱크 가사를 가져옵니다.
zh_hans: 从开放歌词源（LRCLIB、Musixmatch、汽水音乐）获取同步歌词。
zh_hant: 從開放歌詞源（LRCLIB、Musixmatch、汽水音樂）取得同步歌詞。

# onboarding.subtitle
source: Desktop lyrics in a Dynamic Island
ja: ダイナミックアイランドでデスクトップ歌詞を表示
ko: 다이나믹 아일랜드 데스크톱 가사
zh_hans: 灵动岛桌面歌词
zh_hant: 靈動島桌面歌詞

# onboarding.tip.click
source: Click the island to expand/collapse lyrics
ja: アイランドをクリックして歌詞を展開/折りたたみ
ko: 아일랜드를 클릭하여 가사 펼치기/접기
zh_hans: 点击灵动岛展开/收起歌词
zh_hant: 點按靈動島展開/收起歌詞

# onboarding.tip.menu
source: Use menu bar ♪ icon for settings
ja: メニューバーの ♪ アイコンから設定
ko: 메뉴 막대 ♪ 아이콘으로 설정
zh_hans: 通过菜单栏 ♪ 图标进行设置
zh_hant: 透過選單列 ♪ 圖示進行設定

# onboarding.tip.offset
source: Press [ ] to adjust lyrics timing offset
ja: [ ] キーで歌詞のタイミングオフセットを調整
ko: [ ] 키로 가사 타이밍 오프셋 조정
zh_hans: 按 [ ] 键微调歌词时间偏移
zh_hant: 按 [ ] 鍵微調歌詞時間偏移

# picker.line_count %lld
source: %lld lines
ja: %lld 行
ko: %lld 줄
zh_hans: %lld 行
zh_hant: %lld 行

# picker.loading %@
source: Loading %@…
ja: %@ を読み込み中…
ko: %@ 로딩 중…
zh_hans: 正在加载 %@…
zh_hant: 正在載入 %@…

# picker.no_results
source: No lyrics found from any provider.
ja: すべてのプロバイダーから歌詞が見つかりませんでした。
ko: 어떤 소스에서도 가사를 찾을 수 없습니다.
zh_hans: 所有歌词源均未找到歌词。
zh_hant: 所有歌詞來源均未找到歌詞。

# picker.not_found
source: Not Found
ja: 見つかりません
ko: 찾을 수 없음
zh_hans: 未找到
zh_hant: 未找到

# picker.select
source: Select
ja: 選択
ko: 선택
zh_hans: 选择
zh_hant: 選擇

# picker.selected
source: Selected
ja: 選択済み
ko: 선택됨
zh_hans: 已选择
zh_hant: 已選擇

# picker.title
source: Choose Lyrics
ja: 歌詞を選択
ko: 가사 선택
zh_hans: 选择歌词
zh_hant: 選擇歌詞

source: Playback
ja: 再生
ko: 재생
zh_hans: 播放
zh_hant: 播放

# settings.about.issues
source: Report Issue
ja: 問題を報告
ko: 문제 신고
zh_hans: 反馈问题
zh_hant: 回報問題

# settings.about.tagline
source: Desktop lyrics in a Dynamic Island
ja: ダイナミックアイランドでデスクトップ歌詞を表示
ko: 다이나믹 아일랜드 데스크톱 가사
zh_hans: 灵动岛桌面歌词
zh_hant: 靈動島桌面歌詞

# settings.appearance.alignment.center
source: Center
ja: 中央揃え
ko: 가운데
zh_hans: 居中
zh_hant: 置中

# settings.appearance.alignment.left
source: Left
ja: 左揃え
ko: 왼쪽
zh_hans: 左对齐
zh_hant: 靠左

# settings.appearance.alignment.right
source: Right
ja: 右揃え
ko: 오른쪽
zh_hans: 右对齐
zh_hant: 靠右

# settings.appearance.background_section
source: Background
ja: 背景
ko: 배경
zh_hans: 背景
zh_hant: 背景

# settings.appearance.background_style
source: Background Style
ja: 背景スタイル
ko: 배경 스타일
zh_hans: 背景样式
zh_hant: 背景樣式

# settings.appearance.bg.album_gradient
source: Album Gradient
ja: アルバムグラデーション
ko: 앨범 그라데이션
zh_hans: 专辑渐变
zh_hant: 專輯漸層

# settings.appearance.bg.animated_gradient
source: Animated Gradient
ja: アニメーショングラデーション
ko: 애니메이션 그라데이션
zh_hans: 动态渐变
zh_hant: 動態漸層

# settings.appearance.bg.solid
source: Solid
ja: 単色
ko: 단색
zh_hans: 纯色
zh_hant: 純色

# settings.appearance.bg.vibrancy
source: Vibrancy
ja: すりガラス
ko: 반투명
zh_hans: 毛玻璃
zh_hant: 毛玻璃

# settings.appearance.display_section
source: Display
ja: 表示
ko: 디스플레이
zh_hans: 显示
zh_hant: 顯示

# settings.appearance.dual_line
source: Dual-Line Lyrics Mode
ja: 2行歌詞モード
ko: 2줄 가사 모드
zh_hans: 双行歌词模式
zh_hant: 雙行歌詞模式

# settings.appearance.font_size
source: Font Size
ja: フォントサイズ
ko: 글꼴 크기
zh_hans: 字体大小
zh_hant: 字體大小

# settings.appearance.font_size_reset
source: Reset
ja: リセット
ko: 재설정
zh_hans: 重置
zh_hant: 重設

# settings.appearance.font_size_section
source: Font Size
ja: フォントサイズ
ko: 글꼴 크기
zh_hans: 字体大小
zh_hant: 字體大小

# settings.appearance.lyrics_alignment
source: Lyrics Alignment
ja: 歌詞の配置
ko: 가사 정렬
zh_hans: 歌词对齐方式
zh_hant: 歌詞對齊方式

# settings.appearance.show_artwork
source: Show Album Artwork
ja: アルバムアートワークを表示
ko: 앨범 아트워크 표시
zh_hans: 显示专辑封面
zh_hant: 顯示專輯封面

# settings.appearance.solid_color
source: Color
ja: カラー
ko: 색상
zh_hans: 颜色
zh_hant: 顏色

# settings.appearance.solid_color_reset
source: Reset
ja: リセット
ko: 초기화
zh_hans: 重置
zh_hant: 重設

# settings.general.island_section
source: Island Position
ja: アイランドの位置
ko: 아일랜드 위치
zh_hans: 灵动岛位置
zh_hant: 靈動島位置

# settings.general.position_mode
source: Position Mode
ja: 位置モード
ko: 위치 모드
zh_hans: 位置模式
zh_hant: 位置模式

# settings.general.position.attached
source: Attached
ja: 固定
ko: 부착
zh_hans: 吸附菜单栏
zh_hant: 吸附選單列

# settings.general.position.detached
source: Detached
ja: フリー
ko: 분리
zh_hans: 自由拖拽
zh_hant: 自由拖曳

# settings.lyrics.current_offset
source: Current Offset
ja: 現在のオフセット
ko: 현재 오프셋
zh_hans: 当前偏移
zh_hant: 目前偏移

# settings.lyrics.offset_hint
source: Also adjustable with ⌘[ / ⌘] / ⌘0
ja: ⌘[ / ⌘] / ⌘0 でも調整可能
ko: ⌘[ / ⌘] / ⌘0으로도 조정 가능
zh_hans: 也可使用 ⌘[ / ⌘] / ⌘0 调整
zh_hant: 也可使用 ⌘[ / ⌘] / ⌘0 調整

# settings.lyrics.offset_section
source: Offset
ja: オフセット
ko: 오프셋
zh_hans: 偏移
zh_hant: 偏移

# settings.lyrics.offset.earlier
source: −0.5s
ja: −0.5秒
ko: −0.5초
zh_hans: −0.5秒
zh_hant: −0.5秒

# settings.lyrics.offset.later
source: +0.5s
ja: +0.5秒
ko: +0.5초
zh_hans: +0.5秒
zh_hant: +0.5秒

# settings.lyrics.offset.reset
source: Reset
ja: リセット
ko: 초기화
zh_hans: 重置
zh_hant: 重設

# settings.lyrics.providers_hint
source: All enabled providers are searched concurrently; the best match wins.
ja: 有効なプロバイダーを同時に検索し、最もマッチする結果を自動選択します。
ko: 활성화된 제공자를 동시에 검색하여 가장 일치하는 결과를 자동 선택합니다.
zh_hans: 启用的歌词源将同时搜索，自动选择匹配度最高的结果。
zh_hant: 啟用的歌詞源將同時搜尋，自動選擇匹配度最高的結果。

# settings.lyrics.providers_reset
source: Reset to Defaults
ja: デフォルトに戻す
ko: 기본값으로 복원
zh_hans: 恢复默认
zh_hant: 恢復預設

# settings.lyrics.providers_section
source: Lyrics Providers
ja: 歌詞プロバイダー
ko: 가사 제공자
zh_hans: 歌词源
zh_hant: 歌詞源

# settings.shortcuts.open_help
source: Open Help
ja: ヘルプを開く
ko: 도움말 열기
zh_hans: 打开帮助
zh_hant: 開啟輔助說明

# settings.shortcuts.open_settings
source: Open Settings
ja: 設定を開く
ko: 설정 열기
zh_hans: 打开设置
zh_hant: 開啟設定

# settings.shortcuts.quit_app
source: Quit App
ja: アプリを終了
ko: 앱 종료
zh_hans: 退出应用
zh_hant: 結束應用程式

# settings.shortcuts.reset_all
source: Reset All to Defaults
ja: すべてデフォルトにリセット
ko: 모두 기본값으로 초기화
zh_hans: 全部恢复默认
zh_hant: 全部恢復預設值

# settings.shortcuts.section
source: Keyboard Shortcuts
ja: キーボードショートカット
ko: 키보드 단축키
zh_hans: 键盘快捷键
zh_hant: 鍵盤快速鍵

# settings.shortcuts.toggle_lyrics
source: Show/Hide Lyrics
ja: 歌詞を表示/非表示
ko: 가사 표시/숨기기
zh_hans: 显示/隐藏歌词
zh_hant: 顯示/隱藏歌詞

# settings.tab.about
source: About
ja: このアプリについて
ko: 정보
zh_hans: 关于
zh_hant: 關於

# settings.tab.appearance
source: Appearance
ja: 外観
ko: 모양
zh_hans: 外观
zh_hant: 外觀

# settings.tab.general
source: General
ja: 一般
ko: 일반
zh_hans: 通用
zh_hant: 一般

# settings.tab.lyrics
source: Lyrics
ja: 歌詞
ko: 가사
zh_hans: 歌词
zh_hant: 歌詞

# settings.tab.shortcuts
source: Shortcuts
ja: ショートカット
ko: 단축키
zh_hans: 快捷键
zh_hant: 快速鍵
